app/controllers/sessions_controller.rb

	def create
		user = User.find_by(email: session_params[:email], password: session_params[:password])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? AND "users"."password" = ? LIMIT ?  [["email", "aafernandez1@miuandes.cl"], ["password", "Joaco009"], ["LIMIT", 1]]