app/controllers/users_controller.rb

INSERT INTO "users" ("name", "last_name", "email", "phone", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "last_name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "The Bleh "], ["last_name", "Manly Man"], ["updated_at", "2018-04-18 02:25:08.179506"], ["id", 6]]
---
  def update
    @user = User.find(params[:id])
    if @user.update(user_params)